Excavator_Test/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object blockMeshDict;
}

    convertToMeters 1;
    vertices  
    (
      ( -1.1 -0.6 -0.5)
      ( 3.0 -0.6 -0.5)
      ( 3.0 0.65 -0.5)
      ( -1.1 0.65 -0.5)
      ( -1.1 -0.6 1.3)
      ( 3.0 -0.6 1.3)
      ( 3.0 0.65 1.3)
      ( -1.1 0.65 1.3)
    );
    blocks  
    ( hex
      ( 0 1 2 3 4 5 6 7)
      ( 200 60 80) simpleGrading
      ( 1 1 1)
    );
    edges  
    (
    );
    patches  
    ( wall ffminx
      (
      ( 0 4 7 3)) wall ffmaxx
      (
      ( 1 2 6 5)) wall ffminy
      (
      ( 0 1 5 4)) wall ffmaxy
      (
      ( 3 7 6 2)) wall ffminz
      (
      ( 0 3 2 1)) wall ffmaxz
      (
      ( 4 5 6 7))
    );
    mergePatchPairs  
    (
    );