Excavator_Test/CFD/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type fixedValue;
        value uniform ( 0 0 0);
    }

    outlet
    {
        type flowRateInletVelocity;
        value uniform ( 0.0 0.0 0.0 );
        volumetricFlowRate constant -0.22222;
    }

    inlet
    {
        type pressureInletOutletVelocity;
        value uniform ( 0 0 0);
    }

    excavator
    {
        type fixedValue;
        value uniform ( 0 0 0);
    }

}




// ************************************************************************* //
